import { DropdownItem } from "../components/ui/DropdownItem";

export const HelpPage = () => {
  return (
    <div className=" max-w-4xl mx-auto">
      <h2 className="text-3xl font-semibold my-6">FAQ / Допомога</h2>
      <DropdownItem
        title={"Як замовити вино на Terroir UA?"}
        options={[
          "Оберіть улюблене вино або виноробню.",
          "Додайте товар у кошик.",
          "Оформіть замовлення, вказавши свої дані та спосіб доставки.",
          "Очікуйте підтвердження — і вино вже прямує до вас!",
        ]}
      />
      <DropdownItem
        title={"Чи можна замовити напряму від виноробні?"}
        options={[
          "Так! Ми працюємо напряму з виноробнями, тож ваше замовлення надходить безпосередньо від виробника — без зайвих посередників.",
        ]}
      />
      <DropdownItem
        title={"Які є способи оплати?"}
        options={[
          "Оплата онлайн (карткою Visa/MasterCard)",
          "Оплата при отриманні (накладений платіж)",
          "Безготівковий розрахунок для корпоративних клієнтів",
        ]}
      />
      <DropdownItem
        title={"Як працює доставка?"}
        options={[
          "Ми доставляємо по всій Україні через Нову Пошту або інші зручні служби доставки. Зазвичай доставка займає 1–3 дні з моменту підтвердження замовлення.",
        ]}
      />
      <DropdownItem
        title={"Ви продаєте лише українські вина?"}
        options={[
          "Так! Terroir UA — це платформа вин виключно українського виробництва. Ми підтримуємо локальних виноробів і хочемо, щоб українське вино звучало гучніше.",
        ]}
      />
    </div>
  );
};
